Project/Toir.Adaptation/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.торо_ВыявленныеДефекты</registerRecords>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоИнициатора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОбнаружения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79fbf4a8-8f51-4cef-917b-3e00059df530">
    <name>гкс_Влияние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e4aede75-6f77-4f7d-9149-2cd4d20b2f34">
    <name>гкс_ДефектОформленПоТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7c71a5eb-8ff5-48ba-99f5-fb9859401460">
    <name>гкс_НомерТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2fadb04b-3aaa-4dd8-b305-d053aced95ae">
    <name>гкс_СрочностьВоздействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e5d0d56b-7671-492d-a748-7b755db0a10d">
    <name>гкс_КачественнаяОценка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДефектВыявленВПроцессе</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПоследствияДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НаправлениеНаУстранение</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПодразделениеИсполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыПодбораИзМатрицыОценкиРисков</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ID_Ремонта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>РезультатВыбора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0e256218-3632-4e2f-81f1-fbae93c7e394">
    <name>гкс_ФайлыФиксации</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_Ремонты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ГарантийныйРемонт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="c78bcaa2-754f-4a7f-9e89-f5a6e42d7594">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Enums/гкс_СрочностьВоздействия/гкс_СрочностьВоздействия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d2e146a2-c80c-428a-bd99-4e9643aa26ef">
  <name>гкс_СрочностьВоздействия</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="86cc3397-b3f8-4fc5-a934-9003c100daf0">
    <name>Немедленно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0ffe159d-b01b-4ae2-8a4b-09091fa2fab1">
    <name>Сегодня</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d3cd96c8-797d-4759-bdc1-e1acc39999a4">
    <name>ВТечениеНедели</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e6e5d968-5996-4650-8bd4-d4f3f0c3ab21">
    <name>ВТечениеМесяца</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b3a3d867-c6d0-4cdf-ae98-01d265ce81f3">
    <name>ПриСледующейОстановке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="511103f1-671f-4d92-98bf-86c9be5515d7">
    <name>БуфернаяРабота</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Catalogs/торо_Комиссии/торо_Комиссии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_Комиссии</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="9edfc38e-ae9b-42d6-9d75-f050eaf57607">
    <name>гкс_НомерПриказа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3a80e72a-b672-4f54-9f48-f0396ae2445b">
    <name>гкс_ДатаПриказа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

Project/Toir.Adaptation/src/Documents/торо_ВыявленныеДефекты/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Гкс+[TOIR20-570/TOIR20-576] Зозуля А.В. от 14.04.2025. Добавлено:{
Функция гкс_МаксимальнаяСрочностьВоздействияИКачественнаяОценка(ДанныеТабличнойЧасти) Экспорт
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("СрочностьВоздействия", Перечисления.гкс_СрочностьВоздействия.ПустаяСсылка());
	СтруктураОтвета.Вставить("КачественнаяОценка", Перечисления.гкс_КачественнаяОценкаКритичности.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеТабличнойЧасти.КритичностьДефекта КАК КритичностьДефекта,
		|	ДанныеТабличнойЧасти.ОтказавшийЭлемент КАК ОтказавшийЭлемент
		|ПОМЕСТИТЬ ВТ_ДанныеТабЧасти
		|ИЗ
		|	&ДанныеТабличнойЧасти КАК ДанныеТабличнойЧасти
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ДанныеТабЧасти.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
		|	ВТ_ДанныеТабЧасти.КритичностьДефекта КАК КритичностьДефекта,
		|	торо_ОбъектыРемонта.гкс_КачественнаяОценка КАК КачественнаяОценка,
		|	торо_ОбъектыРемонта.гкс_КатегорияРиска КАК КатегорияРиска
		|ПОМЕСТИТЬ ВТ_ДанныеОбъектаРемонта
		|ИЗ
		|	ВТ_ДанныеТабЧасти КАК ВТ_ДанныеТабЧасти
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ВТ_ДанныеТабЧасти.ОтказавшийЭлемент = торо_ОбъектыРемонта.Ссылка
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_ДанныеТабЧасти.ОтказавшийЭлемент КАК ОтказавшийЭлемент
		|			ИЗ
		|				ВТ_ДанныеТабЧасти КАК ВТ_ДанныеТабЧасти)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ДанныеОбъектаРемонта.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
		|	гкс_СрочностьВоздействия.СрочностьВоздействия КАК СрочностьВоздействия,
		|	1 КАК ПриоритетПоКачественнойОценке
		|ПОМЕСТИТЬ ВТСПриоритетомПоКачественнойОценке
		|ИЗ
		|	ВТ_ДанныеОбъектаРемонта КАК ВТ_ДанныеОбъектаРемонта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СрочностьВоздействия КАК гкс_СрочностьВоздействия
		|		ПО ВТ_ДанныеОбъектаРемонта.КатегорияРиска = гкс_СрочностьВоздействия.КатегорияРиска
		|			И ВТ_ДанныеОбъектаРемонта.КритичностьДефекта = гкс_СрочностьВоздействия.КритичностьДефекта
		|			И (гкс_СрочностьВоздействия.гкс_КачественнаяОценка = ВТ_ДанныеОбъектаРемонта.КачественнаяОценка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДанныеОбъектаРемонта.ОтказавшийЭлемент,
		|	гкс_СрочностьВоздействия.СрочностьВоздействия,
		|	2
		|ИЗ
		|	ВТ_ДанныеОбъектаРемонта КАК ВТ_ДанныеОбъектаРемонта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СрочностьВоздействия КАК гкс_СрочностьВоздействия
		|		ПО ВТ_ДанныеОбъектаРемонта.КатегорияРиска = гкс_СрочностьВоздействия.КатегорияРиска
		|			И ВТ_ДанныеОбъектаРемонта.КритичностьДефекта = гкс_СрочностьВоздействия.КритичностьДефекта
		|			И (гкс_СрочностьВоздействия.гкс_КачественнаяОценка = ЗНАЧЕНИЕ(Перечисление.гкс_КачественнаяОценкаКритичности.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСПриоритетомПоКачественнойОценке.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
		|	МИНИМУМ(ВТСПриоритетомПоКачественнойОценке.ПриоритетПоКачественнойОценке) КАК ПриоритетПоКачественнойОценке
		|ПОМЕСТИТЬ ВТМаксимальныйПриоритетПоКачественнойОценке
		|ИЗ
		|	ВТСПриоритетомПоКачественнойОценке КАК ВТСПриоритетомПоКачественнойОценке
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСПриоритетомПоКачественнойОценке.ОтказавшийЭлемент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСПриоритетомПоКачественнойОценке.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
		|	ВТСПриоритетомПоКачественнойОценке.ПриоритетПоКачественнойОценке КАК ПриоритетПоКачественнойОценке,
		|	ВТСПриоритетомПоКачественнойОценке.СрочностьВоздействия КАК СрочностьВоздействия,
		|	ВЫБОР
		|		КОГДА ВТСПриоритетомПоКачественнойОценке.СрочностьВоздействия = ЗНАЧЕНИЕ(Перечисление.гкс_СрочностьВоздействия.Немедленно)
		|			ТОГДА 1
		|		КОГДА ВТСПриоритетомПоКачественнойОценке.СрочностьВоздействия = ЗНАЧЕНИЕ(Перечисление.гкс_СрочностьВоздействия.Сегодня)
		|			ТОГДА 2
		|		КОГДА ВТСПриоритетомПоКачественнойОценке.СрочностьВоздействия = ЗНАЧЕНИЕ(Перечисление.гкс_СрочностьВоздействия.ВТечениеНедели)
		|			ТОГДА 3
		|		КОГДА ВТСПриоритетомПоКачественнойОценке.СрочностьВоздействия = ЗНАЧЕНИЕ(Перечисление.гкс_СрочностьВоздействия.ВТечениеМесяца)
		|			ТОГДА 4
		|		КОГДА ВТСПриоритетомПоКачественнойОценке.СрочностьВоздействия = ЗНАЧЕНИЕ(Перечисление.гкс_СрочностьВоздействия.ПриСледующейОстановке)
		|			ТОГДА 5
		|		КОГДА ВТСПриоритетомПоКачественнойОценке.СрочностьВоздействия = ЗНАЧЕНИЕ(Перечисление.гкс_СрочностьВоздействия.БуфернаяРабота)
		|			ТОГДА 6
		|		ИНАЧЕ 10
		|	КОНЕЦ КАК ПриоритетПоСрочностиВоздействия
		|ПОМЕСТИТЬ ВТСПриоритетомПоСрочности
		|ИЗ
		|	ВТСПриоритетомПоКачественнойОценке КАК ВТСПриоритетомПоКачественнойОценке
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТМаксимальныйПриоритетПоКачественнойОценке.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
		|	ЕСТЬNULL(ВТСПриоритетомПоСрочности.СрочностьВоздействия, ЗНАЧЕНИЕ(Перечисление.гкс_СрочностьВоздействия.ПустаяСсылка)) КАК СрочностьВоздействия,
		|	ЕСТЬNULL(ВТСПриоритетомПоСрочности.ПриоритетПоСрочностиВоздействия, 10) КАК ПриоритетПоСрочностиВоздействия
		|ИЗ
		|	ВТМаксимальныйПриоритетПоКачественнойОценке КАК ВТМаксимальныйПриоритетПоКачественнойОценке
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСПриоритетомПоСрочности КАК ВТСПриоритетомПоСрочности
		|		ПО ВТМаксимальныйПриоритетПоКачественнойОценке.ОтказавшийЭлемент = ВТСПриоритетомПоСрочности.ОтказавшийЭлемент
		|			И ВТМаксимальныйПриоритетПоКачественнойОценке.ПриоритетПоКачественнойОценке = ВТСПриоритетомПоСрочности.ПриоритетПоКачественнойОценке
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПриоритетПоСрочностиВоздействия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_ДанныеОбъектаРемонта.КачественнаяОценка КАК КачественнаяОценка,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеОбъектаРемонта.КачественнаяОценка = ЗНАЧЕНИЕ(перечисление.гкс_КачественнаяОценкаКритичности.Некритичное)
		|			ТОГДА 3
		|		КОГДА ВТ_ДанныеОбъектаРемонта.КачественнаяОценка = ЗНАЧЕНИЕ(перечисление.гкс_КачественнаяОценкаКритичности.Среднекритичное)
		|			ТОГДА 2
		|		КОГДА ВТ_ДанныеОбъектаРемонта.КачественнаяОценка = ЗНАЧЕНИЕ(перечисление.гкс_КачественнаяОценкаКритичности.Критичное)
		|			ТОГДА 1
		|		ИНАЧЕ 4
		|	КОНЕЦ КАК Порядок
		|ИЗ
		|	ВТ_ДанныеОбъектаРемонта КАК ВТ_ДанныеОбъектаРемонта
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	Запрос.УстановитьПараметр("ДанныеТабличнойЧасти", ДанныеТабличнойЧасти);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаСрочность = РезультатыЗапроса[5].Выбрать();
	Если ВыборкаСрочность.Следующий() Тогда
		СтруктураОтвета.СрочностьВоздействия = ВыборкаСрочность.СрочностьВоздействия;
	КонецЕсли;	
		
	ВыборкаКачественнаяОценка = РезультатыЗапроса[6].Выбрать();
	Если ВыборкаКачественнаяОценка.Следующий() Тогда
		СтруктураОтвета.КачественнаяОценка = ВыборкаКачественнаяОценка.КачественнаяОценка;
	КонецЕсли;	
	
	Возврат СтруктураОтвета;	
	
КонецФункции // } Гкс-[TOIR20-570] Зозуля А.В. от 14.04.2025.   

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ПечатьАктаДефектации")
Функция Расш_гкс_ПечатьАктаДефектации(МассивОбъектов, ПараметрыПечати)

	Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ВыявленныеДефекты.ПФ_MXL_АктДефектации");
	ТабДокумент = Новый ТабличныйДокумент;

	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка КАК Ссылка,
	|	торо_ВыявленныеДефектыСписокДефектов.НомерСтроки КАК НомерСтроки,
	|	торо_ВыявленныеДефектыСписокДефектов.ВидДефекта КАК ВидДефекта,
	|	торо_ВыявленныеДефектыСписокДефектов.ДефектВыявленВПроцессе КАК ДефектВыявленВПроцессе,
	|	торо_ВыявленныеДефектыСписокДефектов.ДефектОписание КАК ДефектОписание,
	|	торо_ВыявленныеДефектыСписокДефектов.ДефектПричина КАК ДефектПричина,
	|	торо_ВыявленныеДефектыСписокДефектов.НаправлениеНаУстранение КАК НаправлениеНаУстранение,
	|	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
	|	торо_ВыявленныеДефектыСписокДефектов.ПоследствияДефекта КАК ПоследствияДефекта,
	|	торо_ВыявленныеДефектыСписокДефектов.ВидРемонтов КАК ВидРемонтов,
	|	торо_ВыявленныеДефектыСписокДефектов.КритичностьДефекта КАК КритичностьДефекта,
	|	торо_ВыявленныеДефектыСписокДефектов.ТиповойДефект КАК ТиповойДефект,
	|	торо_ВыявленныеДефектыСписокДефектов.ID КАК ID,
	|	торо_ВыявленныеДефектыСписокДефектов.ЗакрываетПредписание КАК ЗакрываетПредписание,
	|	торо_ВыявленныеДефектыСписокДефектов.ДокументИсточник КАК ДокументИсточник,
	|	торо_ВыявленныеДефектыСписокДефектов.ПодразделениеИсполнитель КАК ПодразделениеИсполнитель,
	|	торо_ВыявленныеДефектыСписокДефектов.ГарантийныйРемонт КАК ГарантийныйРемонт,
	|	торо_ВыявленныеДефектыСписокДефектов.ГарантийныйОбъект КАК ГарантийныйОбъект
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
	|ГДЕ
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка В(&Ссылка)
	|	И торо_ВыявленныеДефектыСписокДефектов.ID В(&ID)
	|ИТОГИ ПО
	|	Ссылка";

	ЗапросДокументов.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		ЗапросДокументов.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		ЗапросДокументов.Текст = СтрЗаменить(ЗапросДокументов.Текст, "И торо_ВыявленныеДефектыСписокДефектов.ID В(&ID)", "");
	КонецЕсли;
	#Вставка
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	#КонецВставки

	ЭтоПервый = Истина;

	ВыборкаДокументов = ЗапросДокументов.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	Пока ВыборкаДокументов.Следующий() Цикл

		Дефект = ВыборкаДокументов.Ссылка;
		ВыборкаКомиссия = ПолучитьКомиссию(Дефект);
		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);

		Пока ВыборкаРемонтов.Следующий() Цикл
			Если НЕ ЭтоПервый Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;

			ОР = ВыборкаРемонтов.ОбъектРемонта;

			// Выводим общие реквизиты шапки	
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Организация 		= Дефект.Организация;
			ОбластьМакета.Параметры.ОбъектРемонта 		= торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ОР);
			ОбластьМакета.Параметры.НомерДокумента 		= Дефект.Номер;
			#Вставка
			ОбластьМакета.Параметры.ДатаДокумента 		= Дефект.Дата + (СдвигЧП * 3600);
			#КонецВставки
			#Удаление
			ОбластьМакета.Параметры.ДатаДокумента 		= Дефект.Дата;
			#КонецУдаления

			ОбластьМакета.Параметры.СтанционныйНомер 	= СокрЛП(ОР.ИнвентарныйНомер);
			//ОбластьМакета.Параметры.ДатаАкта 			= Дефект.Дата;

			ТабДокумент.Вывести(ОбластьМакета);

			// Комиссиия
			ВывестиКомиссию(ТабДокумент, ВыборкаКомиссия, Макет);

			// Выводим пункты 1, 2,3
			ОбластьМакета =  Макет.ПолучитьОбласть("Пункты_1_2_3");
			ОбластьМакета.Параметры.ОбъектРемонта 				= торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ОР);
			ОбластьМакета.Параметры.СтанционныйНомер 			= СокрЛП(ОР.ИнвентарныйНомер);
			ОбластьМакета.Параметры.ЗаводИзготовитель 			= СокрЛП(?(ЗначениеЗаполнено(ОР.Изготовитель), ОР.Изготовитель, ОР.ТиповойОР.Изготовитель));
			ОбластьМакета.Параметры.ТипОборудования 			= СокрЛП(ОР.ТиповойОР);
			ОбластьМакета.Параметры.ЗаводскойНомер 				= СокрЛП(ОР.ЗаводскойНомер);
			#Вставка
			ОбластьМакета.Параметры.ДатаВыпуска 				= ОР.ДатаВыпуска + (СдвигЧП * 3600);
			ОбластьМакета.Параметры.ДатаВводаВЭксплуатацию 		= ОР.ДатаВводаВЭксплуатацию + (СдвигЧП * 3600);
			#КонецВставки
			#Удаление
			ОбластьМакета.Параметры.ДатаВыпуска 				= ОР.ДатаВыпуска;
			ОбластьМакета.Параметры.ДатаВводаВЭксплуатацию 		= ОР.ДатаВводаВЭксплуатацию;
			#КонецУдаления

			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	торо_Ремонты.ID КАК ID,
			|	торо_Ремонты.ДатаНачалаФакт КАК ДатаНачалаФакт
			|ПОМЕСТИТЬ Цепочка
			|ИЗ
			|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
			|ГДЕ
			|	торо_Ремонты.ОбъектРемонта = &ОбъектРемонта
			|	И торо_Ремонты.ВидРемонта.КапитальныйРемонт = ИСТИНА
			|
			|УПОРЯДОЧИТЬ ПО
			|	торо_Ремонты.ДатаНачалаФакт УБЫВ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	торо_Ремонты.ID КАК ID,
			|	Цепочка.ДатаНачалаФакт КАК ДатаНачалаФакт,
			|	торо_Ремонты.ДатаОкончанияПлан КАК ДатаОкончанияПлан
			|ИЗ
			|	Цепочка КАК Цепочка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
			|		ПО Цепочка.ID = торо_Ремонты.ID
			|ГДЕ
			|	торо_Ремонты.ДатаОкончанияПлан <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
			Запрос.УстановитьПараметр("ОбъектРемонта", ОР.Ссылка);
			Результат = Запрос.Выполнить().Выбрать();
			Пока Результат.Следующий() Цикл
				#Вставка
				ДатаНачалаФ = Результат.ДатаНачалаФакт + (СдвигЧП * 3600);
				ОбластьМакета.Параметры.ДатаМесяцНачалаКапРемонта 	= Формат(ДатаНачалаФ, "ДФ=дд") 
					+ "." + Формат(ДатаНачалаФ, "ДФ=ММ");
				ОбластьМакета.Параметры.ГодНачалаКапРемонта 		= Формат(ДатаНачалаФ, "ДФ=гг");
				ОбластьМакета.Параметры.ГодОкончанияКапРемонта 		= Формат(Результат.ДатаОкончанияПлан + (СдвигЧП * 3600), "ДФ=гг");
				#КонецВставки
				#Удаление
				ОбластьМакета.Параметры.ДатаМесяцНачалаКапРемонта 	= Формат(Результат.ДатаНачалаФакт, "ДФ=дд") + "." + Формат(Результат.ДатаНачалаФакт, "ДФ=ММ");
				ОбластьМакета.Параметры.ГодНачалаКапРемонта 		= Формат(Результат.ДатаНачалаФакт, "ДФ=гг");
				ОбластьМакета.Параметры.ГодОкончанияКапРемонта 		= Формат(Результат.ДатаОкончанияПлан, "ДФ=гг");
				#КонецУдаления
			КонецЦикла;

			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим описание дефектов
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаДеффектов");
			// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
			СтрокаОписания = ВыборкаРемонтов.ДефектОписание + НСтр("ru=' элемента ';en='element';es=' of element '") + торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ВыборкаРемонтов.ОтказавшийЭлемент);
			//СтрокаОписания = ВыборкаРемонтов.ДефектОписание + " элемента " + торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ВыборкаРемонтов.ОтказавшийЭлемент);
			// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
			ОбластьМакета.Параметры.ОписаниеДеффекта = СокрЛП(СтрокаОписания);	
			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим пункт 4	
			ОбластьМакета =  Макет.ПолучитьОбласть("Пункт_4");
			ТабДокумент.Вывести(ОбластьМакета);

			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаРабот");
			// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
			СтрокаОписания = ВыборкаРемонтов.НаправлениеНаУстранение + НСтр("ru=' элемента ';en='element';es=' of element '") + торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ВыборкаРемонтов.ОтказавшийЭлемент);
			//СтрокаОписания = ВыборкаРемонтов.НаправлениеНаУстранение + " элемента " + торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ВыборкаРемонтов.ОтказавшийЭлемент);
			// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
			ОбластьМакета.Параметры.ОписаниеРаботы = СокрЛП(СтрокаОписания);	
			ТабДокумент.Вывести(ОбластьМакета);

		КонецЦикла;

	КонецЦикла;

	// Зададим параметры макета
	ТабДокумент.АвтоМасштаб	= Истина;
	ТабДокумент.ПолеСверху  = 0;
	ТабДокумент.ПолеСлева   = 0;
	ТабДокумент.ПолеСнизу   = 0;
	ТабДокумент.ПолеСправа  = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;

	ТабДокумент.ТолькоПросмотр = Истина;

	Возврат ТабДокумент;


КонецФункции

&ИзменениеИКонтроль("ПечатьДефектнойВедомости")
Функция Расш_гкс_ПечатьДефектнойВедомости(МассивОбъектов, ПараметрыПечати)

	ТабДок = Новый ТабличныйДокумент;
	#Вставка
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	#КонецВставки

	// >> [Деснол] [Ушаков А.Д.] [16.09.2019] 
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ВыявленныеДефекты.ПФ_MXL_ДефектнаяВедомость");
	Макет = торо_Локализация.МакетПечатнойФормы("Документ.торо_ВыявленныеДефекты.ПФ_MXL_ДефектнаяВедомость");
	// << [Деснол] [Ушаков А.Д.] [16.09.2019] 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыявленныеДефекты.Ссылка КАК Ссылка,
	|	торо_ВыявленныеДефекты.Номер КАК Номер,
	|	торо_ВыявленныеДефекты.Дата КАК Дата,
	|	торо_ВыявленныеДефекты.ДатаОбнаружения КАК ДатаОбнаружения,
	|	торо_ВыявленныеДефекты.ДефектВыявленВПроцессе КАК ДефектВыявленВПроцессе,
	|	торо_ВыявленныеДефекты.Организация КАК Организация,
	|	торо_ВыявленныеДефекты.Подразделение КАК Подразделение,
	|	торо_ВыявленныеДефекты.Ответственный КАК Ответственный,
	|	торо_ВыявленныеДефекты.Инициатор КАК Инициатор,
	|	торо_ВыявленныеДефекты.СписокДефектов.(
	|		ВидДефекта КАК ВидДефекта,
	|		ДефектВыявленВПроцессе КАК ДефектВыявленВПроцессе,
	|		ДефектОписание КАК ДефектОписание,
	|		ДефектПричина КАК ДефектПричина,
	|		НаправлениеНаУстранение КАК НаправлениеНаУстранение,
	|		ОбъектРемонта КАК ОбъектРемонта,
	|		ОтказавшийЭлемент КАК ОтказавшийЭлемент,
	|		ПоследствияДефекта КАК ПоследствияДефекта,
	|		КритичностьДефекта КАК КритичностьДефекта,
	|		КрайняяДопустимаяДатаЗавершенияРемонта КАК КрайняяДопустимаяДатаЗавершенияРемонта,
	|		ДатаНачалаРемонта КАК ДатаНачалаРемонта,
	|		ДатаОкончанияРемонта КАК ДатаОкончанияРемонта
	|	) КАК СписокДефектов
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|ГДЕ
	|	торо_ВыявленныеДефекты.Ссылка В(&Ссылка)";

	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();

	ЭтоПервый = Истина;

	ФОНазначениеНаРемонтСУчетомРисков = ПолучитьФункциональнуюОпцию("торо_НазначениеНаРемонтСУчетомРисков");

	Пока ВыборкаДокументов.Следующий() Цикл
		Если НЕ ЭтоПервый Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;

		ШапкаДокумента                 = Макет.ПолучитьОбласть("ШапкаДокумента");

		Если ФОНазначениеНаРемонтСУчетомРисков Тогда

			ШапкаДокументаЗаголовокТаблицы = Макет.ПолучитьОбласть("ШапкаДокументаЗаголовокТаблицыМОР");
			СтрокаТаблицаНомераКолонок     = Макет.ПолучитьОбласть("СтрокаТаблицаНомераКолонокМОР");
			СтрокаТаблицыОР                = Макет.ПолучитьОбласть("СтрокаТаблицыОРМОР");
			СтрокаТаблицаОтказавшийЭлемент = Макет.ПолучитьОбласть("СтрокаТаблицаОтказавшийЭлементМОР");

		Иначе

			ШапкаДокументаЗаголовокТаблицы = Макет.ПолучитьОбласть("ШапкаДокументаЗаголовокТаблицы");
			СтрокаТаблицаНомераКолонок     = Макет.ПолучитьОбласть("СтрокаТаблицаНомераКолонок");
			СтрокаТаблицыОР                = Макет.ПолучитьОбласть("СтрокаТаблицыОР");
			СтрокаТаблицаОтказавшийЭлемент = Макет.ПолучитьОбласть("СтрокаТаблицаОтказавшийЭлемент");

		КонецЕсли; 

		ПодвалОтветственные            = Макет.ПолучитьОбласть("ПодвалОтветственные");

		ШапкаДокумента.Параметры.НомерДокумента           = ВыборкаДокументов.Номер;
		#Вставка
		ШапкаДокумента.Параметры.ДатаДокумента            = ВыборкаДокументов.Дата + (СдвигЧП * 3600);
		#КонецВставки
		#Удаление
		ШапкаДокумента.Параметры.ДатаДокумента            = ВыборкаДокументов.Дата;
		#КОнецУдаления
		ШапкаДокумента.Параметры.Подразделение            = ВыборкаДокументов.Подразделение;
		ШапкаДокумента.Параметры.Организация              = ВыборкаДокументов.Организация;
		#Вставка
		ШапкаДокумента.Параметры.ДатаОбнаружения          = ВыборкаДокументов.ДатаОбнаружения + (СдвигЧП * 3600);
		#КонецВставки
		#Удаление
		ШапкаДокумента.Параметры.ДатаОбнаружения          = ВыборкаДокументов.ДатаОбнаружения; 
		#КонецУдаления
		ШапкаДокумента.Параметры.ДефектВыявленВПроцессе   = ВыборкаДокументов.ДефектВыявленВПроцессе; 
		ШапкаДокумента.Параметры.Инициатор                = ВыборкаДокументов.Инициатор; 	

		ТабДок.Вывести(ШапкаДокумента);	

		ТабДок.Вывести(ШапкаДокументаЗаголовокТаблицы);		

		ТабДок.Вывести(СтрокаТаблицаНомераКолонок);
		ГруппаОтказавшихЭлементов=Неопределено;
		ном=1;

		ТЧДефектов = ВыборкаДокументов.СписокДефектов.Выгрузить();

		Для Каждого Дефект Из ТЧДефектов Цикл
			ОбъектРемонтаИзТЧ = Дефект.ОбъектРемонта;

			Если не (ОбъектРемонтаИзТЧ = ГруппаОтказавшихЭлементов) или (ГруппаОтказавшихЭлементов=Неопределено) Тогда 
				СтрокаТаблицыОР.Параметры.ОбъектРемонта = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ОбъектРемонтаИзТЧ);

				ТабДок.Вывести(СтрокаТаблицыОР);
				ГруппаОтказавшихЭлементов= ОбъектРемонтаИзТЧ;
			КонецЕсли;

			СтрокаТаблицаОтказавшийЭлемент.Параметры.н = ном;
			СтрокаТаблицаОтказавшийЭлемент.Параметры.ОтказавшийЭлемент = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Дефект.ОтказавшийЭлемент);
			СтрокаТаблицаОтказавшийЭлемент.Параметры.ВидДефекта             = Дефект.ВидДефекта;
			СтрокаТаблицаОтказавшийЭлемент.Параметры.ОписаниеДефекта        = Дефект.ДефектОписание;
			СтрокаТаблицаОтказавшийЭлемент.Параметры.ПричинаДефекта         = Дефект.ДефектПричина;
			СтрокаТаблицаОтказавшийЭлемент.Параметры.УстранениеДефекта      = Дефект.НаправлениеНаУстранение;
			СтрокаТаблицаОтказавшийЭлемент.Параметры.ПоследствияДефекта     = Дефект.ПоследствияДефекта;

			Если ФОНазначениеНаРемонтСУчетомРисков Тогда

				#Удаление
				СтрокаТаблицаОтказавшийЭлемент.Параметры.ДатаНачала         = Дефект.ДатаНачалаРемонта;
				СтрокаТаблицаОтказавшийЭлемент.Параметры.ДатаОкончания      = Дефект.ДатаОкончанияРемонта;
				СтрокаТаблицаОтказавшийЭлемент.Параметры.КДДЗР              = Дефект.КрайняяДопустимаяДатаЗавершенияРемонта;
				#КонецУдаления
				#Вставка
				СтрокаТаблицаОтказавшийЭлемент.Параметры.ДатаНачала         = Дефект.ДатаНачалаРемонта + (СдвигЧП * 3600);
				СтрокаТаблицаОтказавшийЭлемент.Параметры.ДатаОкончания      = Дефект.ДатаОкончанияРемонта + (СдвигЧП * 3600);
				СтрокаТаблицаОтказавшийЭлемент.Параметры.КДДЗР              = Дефект.КрайняяДопустимаяДатаЗавершенияРемонта + (СдвигЧП * 3600);
				#КонецВставки

			КонецЕсли; 

			ном = ном + 1;

			ТабДок.Вывести(СтрокаТаблицаОтказавшийЭлемент);
		КонецЦикла;

		ПодвалОтветственные.Параметры.Ответственный = ВыборкаДокументов.Ответственный;
		ТабДок.Вывести(ПодвалОтветственные);

	КонецЦикла;

	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабДок.ТолькоПросмотр      = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;

	Возврат ТабДок;


КонецФункции

// гкс+ [11.22] Деснол 24.11.2022
&После("ДобавитьКомандыПечати")
Процедура гкс_ДобавитьКомандыПечати(КомандыПечати)
	// Дефектная ведомость
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ВыявленныеДефекты";
	КомандаПечати.Идентификатор = "дс_ДефектныйАкт";
	КомандаПечати.Представление = НСтр("es='Defective act';ru='Дефектный акт';en='Defective act'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
КонецПроцедуры // гкс- [11.22] Деснол 24.11.2022

// гкс+ [11.22] Деснол 24.11.2022
&После("Печать")
Процедура гкс_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "дс_ДефектныйАкт") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"дс_ДефектныйАкт", 
		НСтр("es='Defective act';ru='Дефектный акт';en='Defective act'"), 
		дс_ПечатьДефектныйАкт(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_ВыявленныеДефекты.ПФ_MXL_дс_ДефектныйАкт");
		
	КонецЕсли;
КонецПроцедуры // гкс- [11.22] Деснол 24.11.2022

// гкс+ [11.22] Деснол 24.11.2022
Функция дс_ПечатьДефектныйАкт(МассивОбъектов, ПараметрыПечати)

	Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ВыявленныеДефекты.ПФ_MXL_дс_ДефектныйАкт");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаСтрока1 = Макет.ПолучитьОбласть("ШапкаСтрока1");
	ОбластьШапкаСтрока2 = Макет.ПолучитьОбласть("ШапкаСтрока2");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвалСтрока1 = Макет.ПолучитьОбласть("ПодвалСтрока1");
	ОбластьПодвалСтрока2 = Макет.ПолучитьОбласть("ПодвалСтрока2");
	ТабДокумент = Новый ТабличныйДокумент;

	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка КАК Ссылка,
	|	торо_ВыявленныеДефектыСписокДефектов.НомерСтроки КАК НомерСтроки,
	|	торо_ВыявленныеДефектыСписокДефектов.ДефектОписание КАК ДефектОписание,
	|	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент КАК ОР,
	|	торо_ВыявленныеДефектыСписокДефектов.ID КАК ID,
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Комиссия КАК Комиссия,
	|	торо_Комиссии.гкс_НомерПриказа КАК гкс_НомерПриказа,
	|	торо_Комиссии.гкс_ДатаПриказа КАК гкс_ДатаПриказа
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_Комиссии КАК торо_Комиссии
	|		ПО торо_ВыявленныеДефектыСписокДефектов.Ссылка.Комиссия = торо_Комиссии.Ссылка
	|ГДЕ
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка В(&Ссылка)
	|	И торо_ВыявленныеДефектыСписокДефектов.ID В(&ID)
	|ИТОГИ
	|	МАКСИМУМ(Комиссия)
	|ПО
	|	Ссылка";
	// гкс+ [01.23] Деснол 18.01.2023
	ЗапросДокументов.Текст = ЗапросДокументов.Текст + " ; "
	+ "ВЫБРАТЬ
          |	Дефект.Ссылка КАК Ссылка,
          |	ЕСТЬNULL(КадроваяИсторияСотрудниковСрезПоследних.Сотрудник, Подразделения.ТекущийРуководитель) КАК Сотрудник,
          |	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность,
          |	КадроваяИсторияСотрудниковСрезПоследних.Период КАК Период
          |ИЗ
          |	Документ.торо_ВыявленныеДефекты КАК Дефект
          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК Подразделения
          |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&Дата, ) КАК КадроваяИсторияСотрудниковСрезПоследних
          |			ПО Подразделения.ТекущийРуководитель = КадроваяИсторияСотрудниковСрезПоследних.Сотрудник.ФизическоеЛицо
          |		ПО (Подразделения.Ссылка = Дефект.Подразделение)
          |ГДЕ
          |	Дефект.Ссылка В(&Ссылка)
          |
          |УПОРЯДОЧИТЬ ПО
          |	Период УБЫВ
          |ИТОГИ ПО
          |	Ссылка";
	// гкс- [01.23] Деснол 18.01.2023
	
	ЗапросДокументов.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		ЗапросДокументов.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		ЗапросДокументов.Текст = СтрЗаменить(ЗапросДокументов.Текст, "И торо_ВыявленныеДефектыСписокДефектов.ID В(&ID)", "");
	КонецЕсли;
	
	ЭтоПервый = Истина;
	// гкс+ [01.23] Деснол 18.01.2023
	ЗапросДокументов.УстановитьПараметр("Дата", Дата(3999, 1, 1));
	РезультатЗапроса = ЗапросДокументов.ВыполнитьПакет();
	ВыборкаДокументов = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ВыборкаСотрудникПодразделения = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	// гкс- [01.23] Деснол 18.01.2023
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Дефект = ВыборкаДокументов.Ссылка;
		#Область ПоискКомиссии
		СтруктураОтбора = Новый Структура("Комиссия,Дата", ВыборкаДокументов.Комиссия, Дата(3999, 1, 1));
		
		ВыборкаКомиссия = ПолучитьКомиссию(СтруктураОтбора);
		МассивСтруктурКомиссии = Новый Массив();
		
		Если ВыборкаКомиссия.Следующий() Тогда
			
			СтруктураКомиссии = Новый Структура();
			СтруктураКомиссии.Вставить("ФИО", ПреобразоватьФИО(ВыборкаКомиссия.ПредседательКомиссии));
			СтруктураКомиссии.Вставить("Должность", ВыборкаКомиссия.ДолжностьПредседателя);
			МассивСтруктурКомиссии.Добавить(СтруктураКомиссии);
			
			ВыборкаЧленыКомиссии = ВыборкаКомиссия.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаЧленыКомиссии.Следующий() Цикл
				СтруктураКомиссии = Новый Структура();
				СтруктураКомиссии.Вставить("ФИО", ПреобразоватьФИО(ВыборкаЧленыКомиссии.ЧленКомиссии));
				СтруктураКомиссии.Вставить("Должность", ВыборкаЧленыКомиссии.Должность);
				МассивСтруктурКомиссии.Добавить(СтруктураКомиссии);
			КонецЦикла;
			
		КонецЕсли;
		// гкс+ [01.23] Деснол 18.01.2023
		СтруктураЗаявителя = Новый Структура();
		ВыборкаСотрудникПодразделения.Сбросить();
		Если ВыборкаСотрудникПодразделения.НайтиСледующий(Новый Структура("Ссылка", ВыборкаДокументов.Ссылка)) Тогда 
			ВыборкаДолжность = ВыборкаСотрудникПодразделения.Выбрать();
			ВыборкаДолжность.Следующий();
			СтруктураЗаявителя.Вставить("ФИО", ПреобразоватьФИО(ВыборкаДолжность.Сотрудник));
			СтруктураЗаявителя.Вставить("Должность", ВыборкаДолжность.Должность);
		КонецЕсли;
		// гкс- [01.23] Деснол 18.01.2023
		#КонецОбласти
		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		Пока ВыборкаРемонтов.Следующий() Цикл
			Если НЕ ЭтоПервый Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;
			
			ОР = ВыборкаРемонтов.ОР;
			
			ОбластьШапка.Параметры.Номер 		= Дефект.Номер;
			ОбластьШапка.Параметры.НомерКомиссии 		= ВыборкаРемонтов.гкс_НомерПриказа;
			ОбластьШапка.Параметры.ДатаКомиссии 		= ВыборкаРемонтов.гкс_ДатаПриказа;
			ОбластьШапка.Параметры.Должность 		= "";
			ОбластьШапка.Параметры.ФИО 		= "";
			Если МассивСтруктурКомиссии.Количество() Тогда 
				ОбластьШапка.Параметры.Должность = МассивСтруктурКомиссии[0].Должность;
				ОбластьШапка.Параметры.ФИО = МассивСтруктурКомиссии[0].ФИО;
			КонецЕсли;

			ТабДокумент.Вывести(ОбластьШапка);
			Если МассивСтруктурКомиссии.Количество() > 1 Тогда 
				ОбластьШапкаСтрока1.Параметры.Должность = МассивСтруктурКомиссии[1].Должность;
				ОбластьШапкаСтрока1.Параметры.ФИО = МассивСтруктурКомиссии[1].ФИО;
				ТабДокумент.Вывести(ОбластьШапкаСтрока1);
			КонецЕсли;
						
			НомерПП = 2;
			Пока НомерПП < МассивСтруктурКомиссии.Количество() Цикл
				ОбластьШапкаСтрока2.Параметры.Должность = МассивСтруктурКомиссии[НомерПП].Должность;
				ОбластьШапкаСтрока2.Параметры.ФИО = МассивСтруктурКомиссии[НомерПП].ФИО;
				ТабДокумент.Вывести(ОбластьШапкаСтрока2);
				НомерПП = НомерПП + 1;
			КонецЦикла;
			// гкс+ [01.23] Деснол 18.01.2023
			Если СтруктураЗаявителя.Свойство("ФИО") Тогда 
				ОбластьШапкаСтрока2.Параметры.Должность = СтруктураЗаявителя.Должность;
				ОбластьШапкаСтрока2.Параметры.ФИО = СтруктураЗаявителя.ФИО;
				ТабДокумент.Вывести(ОбластьШапкаСтрока2);
			КонецЕсли;
			// гкс- [01.23] Деснол 18.01.2023
			
			ОбластьПодвал.Параметры.ОР = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ОР);
			ОбластьПодвал.Параметры.ОписаниеДефекта = ВыборкаРемонтов.ДефектОписание;
			
			Если МассивСтруктурКомиссии.Количество() Тогда 
				ОбластьПодвал.Параметры.Должность = МассивСтруктурКомиссии[0].Должность;
				ОбластьПодвал.Параметры.ФИО = МассивСтруктурКомиссии[0].ФИО;
			КонецЕсли;

			ТабДокумент.Вывести(ОбластьПодвал);
			Если МассивСтруктурКомиссии.Количество() > 1 Тогда 
				ОбластьПодвалСтрока1.Параметры.Должность = МассивСтруктурКомиссии[1].Должность;
				ОбластьПодвалСтрока1.Параметры.ФИО = МассивСтруктурКомиссии[1].ФИО;
				ТабДокумент.Вывести(ОбластьПодвалСтрока1);
			КонецЕсли;
			
			НомерПП = 2;
			Пока НомерПП < МассивСтруктурКомиссии.Количество() Цикл
				ОбластьПодвалСтрока2.Параметры.Должность = МассивСтруктурКомиссии[НомерПП].Должность;
				ОбластьПодвалСтрока2.Параметры.ФИО = МассивСтруктурКомиссии[НомерПП].ФИО;
				ТабДокумент.Вывести(ОбластьПодвалСтрока2);
				НомерПП = НомерПП + 1;
			КонецЦикла;
			// гкс+ [01.23] Деснол 18.01.2023
			Если СтруктураЗаявителя.Свойство("ФИО") Тогда 
				ОбластьПодвалСтрока2.Параметры.Должность = СтруктураЗаявителя.Должность;
				ОбластьПодвалСтрока2.Параметры.ФИО = СтруктураЗаявителя.ФИО;
				ТабДокумент.Вывести(ОбластьПодвалСтрока2);
			КонецЕсли;
			// гкс- [01.23] Деснол 18.01.2023
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Зададим параметры макета
	ТабДокумент.АвтоМасштаб	= Истина;
	ТабДокумент.ПолеСверху  = 0;
	ТабДокумент.ПолеСлева   = 0;
	ТабДокумент.ПолеСнизу   = 0;
	ТабДокумент.ПолеСправа  = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабДокумент.ТолькоПросмотр = Истина;
	
	Возврат ТабДокумент;
	

КонецФункции // гкс- [11.22] Деснол 24.11.2022

// гкс+ [11.22] Деснол 24.11.2022
Функция ПреобразоватьФИО(Сотрудник)
	ИндексПервойЧастиИмени = 0;
	ИндексВторойЧастиИмени = 1;
	ИндексТретейЧастиИмени = 2;
	МассивИмени = СтрРазделить(Строка(Сотрудник), " ", Ложь);
	Если МассивИмени.Количество() > 2 Тогда 
		Возврат МассивИмени[ИндексПервойЧастиИмени] 
		+ " " + Лев(МассивИмени[ИндексВторойЧастиИмени], 1) 
		+ ". " + Лев(МассивИмени[ИндексТретейЧастиИмени], 1) + ".";
	КонецЕсли;
	Возврат Сотрудник;
КонецФункции // гкс- [11.22] Деснол 24.11.2022

#КонецОбласти
